<?php
/**
 * YaongWiki Engine
 *
 * @version 1.2
 * @author HyunJun Kim
 * @date 2017. 08. 26
 */

const STRINGS = array(
    
    "ESDB0" => "데이터베이스 서버에 접속할 수 없습니다.",
    "ESDB1" => "로그인을 해야 합니다.",

    "EPCR0" => "제목을 한 글자 이상 입력하세요.",
    "EPCR1" => "지식 제목으로 숫자를 사용할 수 없습니다.",
    "EPCR2" => "지식 중복 여부를 확인하지 못했습니다.",
    "EPCR3" => "이미 존재하는 지식입니다.",
    "EPCR4" => "지식을 추가하던 중 서버 오류가 발생하였습니다.",
    "SPCR0" => "새로 만들어짐",

    "EPDH0" => "사용자 정보를 불러오지 못했습니다.",
    "EPDH1" => "최근 로그인 기록을 로드하지 못했습니다.",
    "EPDH2" => "이메일 주소가 올바르지 않습니다.",
    "EPDH3" => "이전과 동일한 이메일 주소가 입력되었습니다.",
    "EPDH4" => "이미 사용 중인 이메일 주소입니다.",
    "EPDH5" => "이메일 주소 변경에 실패하였습니다.",
    "EPDH6" => "이메일 주소를 변경하였습니다.",
    "EPDH7" => "비밀번호와 비밀번호 확인이 일치하지 않습니다.",
    "EPDH8" => "비밀번호는 4자 이상으로 정해야 합니다.",
    "EPDH9" => "현재 비밀번호가 올바르지 않습니다.",
    "EPDH10" => "서버 오류로 비밀번호를 변경하지 못했습니다.",
    "EPDH11" => "비밀번호를 변경하였습니다.",
    "EPDH12" => "서버 오류로 계정을 삭제하지 못했습니다",
    "EPDH13" => "설정을 업데이트하지 못했습니다.",

    "EPIN0" => "DB 서버에 접속할 수 없습니다.",
    "EPIN1" => "DB에 테이블을 추가하지 못했습니다.",

    "EPPF0" => "존재하지 않는 사용자입니다.",
    "EPPF1" => "사용자 기여 정보를 불러오지 못했습니다.",
    "EPPF2" => "사용자 정보를 업데이트하지 못했습니다.",

    "EPRD0" => "존재하지 않는 글입니다.",

    "EPRC0" => "최근 변경 리스트를 불러오지 못했습니다.",

    "EPRS0" => "이메일 주소의 형식이 올바르지 않습니다.",
    "EPRS1" => "reCAPTCHA가 올바르게 입력되지 않았습니다.",
    "EPRS2" => "존재하지 않는 이메일 주소입니다.",
    "EPRS3" => "비밀번호를 업데이트하지 못했습니다.",
    "EPRS4" => "이메일 발송에 실패했습니다.",
    "EPRS5" => "이메일로 새로운 비밀번호를 발송했습니다.",
    "SPRS0" => "새 비밀번호를 알려드립니다.",
    "SPRS1" => "<b>{NAME}</b>님의 새 비밀번호는 <b>{PASSWORD}</b>입니다.",

    "EPRV0" => "존재하지 않는 수정 내역입니다.",
    "EPRV1" => "원본 글이 존재하지 않습니다.",
    "EPRV2" => "글 내용을 되돌리기 위한 권한이 부족합니다.",
    "EPRV3" => "글을 되돌리지 못했습니다.",
    "EPRV4" => "비교 대상 데이터를 불러오지 못했습니다.",
    "SPRV0" => "{REVISION}로부터 복구함",

    "EPSH0" => "검색어가 없습니다.",
    "EPSH1" => "검색 결과가 없습니다.",

    "EPSI0" => "존재하지 않는 계정입니다.",
    "EPSI1" => "비밀번호가 올바르지 않습니다.",

    "EPSU0" => "아이디는 3자 이상이어야 합니다.",
    "EPSU1" => "비밀번호는 4자 이상이어야 합니다.",
    "EPSU2" => "비밀번호와 비밀번호 확인이 일치하지 않습니다.",
    "EPSU3" => "올바르지 않은 이메일 주소 형식입니다.",
    "EPSU4" => "reCAPTCHA가 올바르게 입력되지 않았습니다.",
    "EPSU5" => "이미 사용 중인 아이디입니다.",
    "EPSU6" => "이미 사용 중인 이메일 주소입니다.",
    "EPSU7" => "계정을 생성하지 못했습니다.",

    "EPWR0" => "존재하지 않는 글입니다.",
    "EPWR1" => "이 글을 편집하기 위한 권한이 부족합니다.",
    "EPWR2" => "이 글을 삭제하기 위한 권한이 부족합니다.",
    "EPWR3" => "글을 삭제하지 못했습니다.",
    "EPWR4" => "글 제목은 최소 두 글자 이상이어야 합니다.",
    "EPWR5" => "글 제목으로 숫자를 사용할 수 없습니다.",
    "EPWR6" => "이미 존재하는 글 제목입니다.",
    "EPWR7" => "자신의 권한보다 글 수정 권한을 크게 설정할 수 없습니다.",
    "EPWR8" => "글을 업데이트하지 못했습니다.",
    "EPWR9" => "글을 업데이트하지 못했습니다. (수정 기록 가져오기 실패)",
    "EPWR10" => "수정 기록을 업데이트하지 못했습니다.",
    "EPWR11" => "글을 업데이트하지 못했습니다.",
);